---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCExtrusionData
source: html/c10272e7-741d-1aca-9f64-cc51d0b14e54.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData

Represents the geometry of an extrusion (a solid body or opening) generated
 from Revit geometry.

## Syntax (C#)
```csharp
public class IFCExtrusionData : IDisposable
```